---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropItem
source: html/edcbddd9-85e5-a74d-7f1a-a9e28c1b4164.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropItem

A flow path of the duct/pipe fitting and accessory. It is defined by the begin connector and end connector.

## Syntax (C#)
```csharp
public class DuctFittingAndAccessoryPressureDropItem : IDisposable
```